basic/controllers/ReplyController.php

SELECT * FROM `we_account`
INSERT INTO `we_reply` (`aid`, `rename`, `rekeyword`) VALUES (4, '123', 'å‚»ç‹å­\')
INSERT INTO `we_text_reply` (`reid`, `trcontent`) VALUES (1, 'åˆ˜ä¸€ä¸\¹')
---
	public function actionReply()
	{
		$request=Yii::$app->request->method;
		$requests=Yii::$app->request;
		$db=\Yii::$app->db;
		if ($request!="POST") {

				$arr=WeAccount::find()->asArray()->all();
				//print_r($arr);die;
				return $this->render('reply',['arr'=>$arr]);

		} else {
			$connection=\Yii::$app->db;
			$arr=\Yii::$app->request->post();
			$connection->createCommand()->insert('we_reply', [
				    'aid' => $arr['aid'],
				    'rename' => $arr['rename'],
				    'rekeyword'=>$arr['rekeyword'],
				])->execute();
				$reid=$connection->getLastInsertID();
				//$reid=$connection->getLastInsertID();
				$connection->createCommand()->insert('we_text_reply', [
				    'reid' => "$reid",
                     'trcontent'=>$arr['trcontent'],
				])->execute();